{
  "blogs": [
    {
      "title": "Soaring Prices",
      "date": "2021-06-07",
      "image": "/blogs/",
      "description": "As many have noticed, prices are up on everything. Everything is higher. And while the prices for meat were already high to begin with, then there was a computer attack at a JBS plant that left the plant at a stand-still reducing the supply of our much needed meats that caused the prices to rise even further. Its is crazy right now and we have to be so very careful because one week of unadjusted prices will put us out of business. Each week's shipments come with invoices with higher prices. We used to pay just under $100 for a case of chicken wings.  Now they are just over $200. Brisket was around $2.75 per pound now it is just under $5. And if you factor in shrinkage from trimming and cooking, it costs us $12 per pound on brisket! On top of that is labor and rent and insurance and everything else. <br/> What is the point of this communication? Please be patient with us. \n\n First, our prices are changing almost weekly. There are menus out there with old pricing and sometimes our board is not right. It is difficult to touch all of the places where our prices reside. Our menu is fully integrated with our website so that would theoretically be the best place for prices but we also have to manually synchronize with our POS and Doordash. Also, when the price of brisket goes up, sandwiches, sampler plates, tacos, 1/2 pound items all have to go up.\\n Second, please know, as we have done in the past, when prices decrease to us, they will decrease to you. Kerman, this is your restaurant. We just want to serve great food and beer as long as we can. We understand that there will probably be a point when the food is just not affordable anymore and we will have to close down. Until that time we are going to do everything we can to stay afloat.\\n Third, from last year to this year business is up. That is mostly because COVID restrictions are loosening and prices are up. However, this last Sunday was the slowest Sunday in quite a while. Not sure if it was because of the Soccer game (that we show on our TVs), the boxing match, or if higher prices is what kept people away. It is troubling indeed.\\n Fourth, if you have any advice, we are all ears. We think that a multitude of counsellors is always the best. And, if we cant take criticism then we should not have gotten into the restaurant business to begin with.\\n We at the Den appreciate very much your continued patronage, especially in times like this. It is such a hard decision to go through and raise prices again and again but what else can we do?  We are coming up on our third year anniversary. Wow have we dodged so many curve balls recently and we hope to continue to do so in the coming years as we change, adjust and maneuver. Again, Thank you.\\n PS. If you are new to our mailing list, thank you for joining. We have engaged with a marketing company to help get the word out. There are many specials coming so stay tuned. None of these price increases are because of the specials we are running."
    },
    {
      "title": "",
      "date": "",
      "image": "",
      "description": ""
    },
    {
      "title": "",
      "date": "",
      "image": "",
      "description": ""
    },
    {
      "title": "",
      "date": "",
      "image": "",
      "description": ""
    },
    {
      "title": "",
      "date": "",
      "image": "",
      "description": ""
    },
    {
      "title": "",
      "date": "",
      "image": "",
      "description": ""
    }
  ]
}